{
  "fields": [
    {
      "name": "from_stop_id",
      "type": "",
      "description": "Identifies a stop or station where a connection between routes begins. If this field refers to a station, the transfer rule applies to all its child stops.",
      "gtfs_required": "Required",
      "gtfs_type": "ID referencing `stops.stop_id`",
      "constraints": {
        "required": "true"
      }
    },
    {
      "name": "to_stop_id",
      "type": "",
      "description": "Identifies a stop or station where a connection between routes ends. If this field refers to a station, the transfer rule applies to all child stops.",
      "gtfs_required": "Required",
      "gtfs_type": "ID referencing `stops.stop_id`",
      "constraints": {
        "required": "true"
      }
    },
    {
      "name": "transfer_type",
      "type": "integer",
      "description": "Indicates the type of connection for the specified (`from_stop_id`, `to_stop_id`) pair. Valid options are:<br><br> `0` or empty - Recommended transfer point between routes.<br>`1` - Timed transfer point between two routes. The departing vehicle is expected to wait for the arriving one and leave sufficient time for a rider to transfer between routes.<br>`2` - Transfer requires a minimum amount of time between arrival and departure to ensure a connection. The time required to transfer is specified by `min_transfer_time`.<br>`3` - Transfers are not possible between routes at the location.",
      "gtfs_required": "Required",
      "gtfs_type": "Enum",
      "constraints": {
        "required": "true",
        "enum": [
          0,
          1,
          2,
          3
        ]
      }
    },
    {
      "name": "min_transfer_time",
      "type": "interger",
      "description": "Amount of time, in seconds, that must be available to permit a transfer between routes at the specified stops. The `min_transfer_time` should be sufficient to permit a typical rider to move between the two stops, including buffer time to allow for schedule variance on each route.",
      "gtfs_required": "Optional",
      "gtfs_type": "Non-negative integer",
      "constraints": {
        "minimum": "0"
      }
    }
  ]
}